croghostrider/esp32_hd/main/hd_main.c
		if (sensor_err(t)) break;

		if (t < fabs(tempEndRectRazgon)) break;

		// завершение
		set_status(PROC_STAB);
		DBG("Switch state to stabilization."); // @suppress("No break at end of case")
		 /* fall through */

	case PROC_STAB:		//Стабилизация колонны
		// старт
		t = getTube20Temp();
		if (prev_status!=MainStatus){
			LOG("STABILIZATION");
			openKlp(klp_water);	// Открытие клапана воды
			closeKlp(klp_glwhq);
			closeKlp(klp_sr);
			set_proc_power("powerRect");
			// Запоминаем температуру и время
	        setTempStabSR(t);
			setTempTube20Prev(t);
			secTempPrev = uptime_counter;
			prev_status=MainStatus;
			sprintf(b, "%02d:%02d:%02d стабилизация до %.1f", uptime_counter/3600, (uptime_counter/60)%60, uptime_counter%60, getFloatParam(DEFL_PARAMS, "timeStabKolonna"));
			send_message(b);
			setWaitSensor(DS_TUBE20, 70.0);
		}

		// контроль
		if ( sensor_err(t) || (t < 70))			//сбой датчика или колонна еще не прогрелась, ждем
		{
			DBG("Cube or 20%% tube temperature less 70 dg.");
			secTempPrev = uptime_counter;
			break;
		}

		int timeStabKolonna = getIntParam(DEFL_PARAMS, "timeStabKolonna");

		if (timeStabKolonna > 0) {			// Время считаем относительно последнего изменения температуры
			if (fabs(t - tempTube20Prev) < 0.2) {	// температура колонны в пределах погрешности в 0.2 градуса C
				DBG( "Stabillization %d of %02.0f sec.", uptime_counter-secTempPrev, fabs(timeStabKolonna));
				int rest = (timeStabKolonna)-(int)(uptime_counter-secTempPrev);
				if (rest>0) {// время стабилизации не истекло
					setWaitTime("относит.стабилизацию, осталось %02d:%02d:%02d", rest);
					break; // нет, продолжаем стабилизацию
				}
				// время стабилизации истекло, заканчиваем
			} else { // температура колонны изменилась более чем на 0.2 градуса
				DBG("Stab. temp. changed from %0.2f to %0.2f. Reseting timer.", tempTube20Prev, t);
		        setTempStabSR(t);
				setTempTube20Prev(t); // фиксируем новую температуру
				secTempPrev = uptime_counter;//начинаем отсчет времени с нуля
				break;
			}
		} else {	// время считаем от начала стабилизации
			DBG("Stabillization %d of %0.0f.", uptime_counter-secTempPrev, fabs(timeStabKolonna));
			int rest = (-timeStabKolonna)-(int)(uptime_counter-secTempPrev);
			if (rest>0) {		// время истекло?
				setWaitTime("абс.стабилизацию, осталось %02d:%02d:%02d", rest);
				break; // нет - продолжаем стабилизацию
			}
			// время стабилизации истекло, заканчиваем
		}

		// завершение
		set_status(PROC_GLV);	//переходим к отбору голов.
		DBG("end razgon, switch to `glv` stage"); // @suppress("No break at end of case")
		 /* fall through */

	case PROC_GLV:			// Отбор головных фракций
		;
		float tEndRectOtbGlv =getFloatParam(DEFL_PARAMS, "tEndRectOtbGlv");
		// старт
		if (prev_status!=MainStatus){
			LOG("PROC_GLV");
			prev_status=MainStatus;
			openKlp(klp_water);		// Открытие клапана воды
			closeKlp(klp_sr);				// Отключение клапана отбора товарного продукта
			secTempPrev = uptime_counter;
			setTempStabSR(getTube20Temp());	// температура стабилизации отбора
			set_proc_power("powerRect");
			sprintf(b, "%02d:%02d:%02d головы до %.2f", uptime_counter/3600, (uptime_counter/60)%60, uptime_counter%60, getFloatParam(DEFL_PARAMS, "tEndRectOtbGlv"));
			send_message(b);
			start_valve_PWMpercent(
					klp_glwhq, // медленный ШИМ клапан голов
					getFloatParam(DEFL_PARAMS, "timeChimRectOtbGlv"),
					getFloatParam(DEFL_PARAMS, "procChimOtbGlv"));

			if (tEndRectOtbGlv>0){ 						// tEndRectOtbGlv положительный -> это температура куба завершения отбора голов
				setWaitSensor(DS_CUB, tEndRectOtbGlv);
			}
			else {												// tEndRectOtbGlv отрицательное -> это кол-во минут отбора голов
				setWaitTime("осталось %02d:%02d:%02d",(uint32_t)(-tEndRectOtbGlv*60));
			}
		}

		// контроль

		if (tEndRectOtbGlv>0){ 						// tEndRectOtbGlv положительный -> это температура куба завершения отбора голов
			t = getCubeTemp();
			if (sensor_err(t)) break; 					// ошибка датчика, ждем исправления

			if (t < tEndRectOtbGlv) 	// Т куба не достигла заданной
				break;											// продолжаем
		}
		else {												// tEndRectOtbGlv отрицательное -> это кол-во минут отбора голов
			if ((uptime_counter-secTempPrev) < (-tEndRectOtbGlv*60) )	// время не истекло
			{
				setWaitTime("осталось %02d:%02d:%02d",(uint32_t)(-tEndRectOtbGlv)*60 - (uptime_counter-secTempPrev) );
				break;												// продолжаем
			}
		}

		// Окончание отбора голов
		set_status(PROC_T_WAIT);		// Переходим к стабилизации температуры
		DBG("end glv, switch to `T wait` stage"); // @suppress("No break at end of case")
		 /* fall through */

	case PROC_T_WAIT: // ре-стабилизация  после стопа
		// старт
		t = getTube20Temp();

		if (prev_status!=MainStatus){
			LOG("PROC_RESTAB");
			closeKlp(klp_sr);				// Отключение клапана отбора товарного продукта
			closeKlp(klp_glwhq); 		// Отключение клапана отбора голов/хвостов
			openKlp(klp_water);		// Открытие клапана воды
			if ((prev_status == PROC_SR)){ //попали сюда по "стоп" отбора продукта
				rect_timer1 = getIntParam(DEFL_PARAMS, "timeRestabKolonna");
				sprintf(b, "%02d:%02d:%02d рестабилизация", uptime_counter/3600, (uptime_counter/60)%60, uptime_counter%60);
				send_message(b);
			}
			else {//попали сюда или с отбора голов или после [ре]старта контроллера
				if (!broken_proc){
					setTempStabSR(t); // начальная температура стабилизации
					setNewProcChimSR(getIntParam(DEFL_PARAMS, "beginProcChimOtbSR")); // стартовый % отбора тела
					DBG("broken or HEAD init PWM:%d  init Tstab:%5.1f",getIntParam(DEFL_PARAMS, "beginProcChimOtbSR"),t);
				}
				set_proc_power("powerRect");  //задаем мощность ректификации
			}
			prev_status=MainStatus;
			setWaitTime("рестабилизация на %02d:%02d:%02d", getIntParam(DEFL_PARAMS, "timeRestabKolonna"));
		}
		if (sensor_err(t)) break; // сбой датчика, ждем
		if (tempStabSR <= 0) setTempStabSR(28.5);

		//-----------контроль
		// настройка времени рестабилизации не ноль и истек таймер: принимаем текущую температуру за Тстаб
		if ( (0 == rect_timer1) &&  // таймер досчитал
			 (getIntParam(DEFL_PARAMS, "timeRestabKolonna") > 0) // настройка времени стабилизации не ноль
			) {
			DBG("restab. newTstab:%0.2f  timer:%d setting:%d", tempStabSR,rect_timer1,getIntParam(DEFL_PARAMS, "timeRestabKolonna"));
			setTempStabSR(getTube20Temp());		// принимаем текущую температуру за Тстаб
			if (getIntParam(DEFL_PARAMS, "beepChangeState")) myBeep(true);
		}

		//  пока рестабилизировались - не пришла ли пора завершить тело и перейти к хвостам?
		if (end_condition_SR())	{
       		set_status(PROC_HV); // Уходим на стадию отбора хвостов
			break;
		}
		
		//  проверим: Т низа колонные снизилась до Тстаб?
		if (getTube20Temp() > tempStabSR) {
			setWaitTime("осталось %02d:%02d:%02d",rect_timer1);
			break; //если нет, остаемся в рестабилизации
		}
		//рестабилизация завершена

