croghostrider/esp32_hd/main/hd_main.c
			case cmd_close:
				if (Klp[qcmd.valve_num].is_open){ // закрываем если открыт
#ifdef DEBUGV
					xLastWakeTime = xTaskGetTickCount ();
					DBGV("OFF:%d(%d ms)", qcmd.valve_num, (xLastWakeTime-prevValveSwitch)*portTICK_PERIOD_MS);
					prevValveSwitch =xLastWakeTime;
#endif
					ledc_set_duty(LEDC_HIGH_SPEED_MODE, ch, 0);
					ledc_update_duty(LEDC_HIGH_SPEED_MODE, ch);
					LEDC.channel_group[0].channel[ch].conf0.sig_out_en = 0;
					Klp[qcmd.valve_num].is_open = false;
				}
				else {
					DBGV("cmd close ignored");
				}
				break;
			default:
				break;
		}
	}
}

void setTimezone(int gmt_offset){
	char tz[10];
	snprintf(tz, 10, "CST-%d", gmt_offset);
	setenv("TZ", tz, 1);
	tzset();
}

void restoreProcess(void) {
	int16_t pw;
	if (!nvsHandle) {
		ERR_MSG("no NVS handle, process isn't restored");
		return;
	}
	nvs_get_i16(nvsHandle, "MainMode", (int16_t*)&MainMode);
	nvs_get_i16(nvsHandle, "SetPower", &pw);
	nvs_get_i16(nvsHandle, "MainStatus", &MainStatus);
	ESP_LOGI(__func__,"MMode:%d State:%d Power:%d",MainMode,MainStatus,pw);
	switch (MainMode) {
		case  MODE_RECTIFICATION:
		case  MODE_DISTIL:
			if ( (MainStatus>PROC_START) && (MainStatus<PROC_END)){
				broken_proc = true;
				nvs_get_u64(nvsHandle, "tempStabSR", (uint64_t*)&tempStabSR);
				nvs_get_u64(nvsHandle, "tempTube20Prev", (uint64_t*)&tempTube20Prev);
				nvs_get_i16(nvsHandle, "ProcChimSR", &ProcChimSR);
				ESP_LOGI(__func__,"broken proc=true  Tstab:%02.1f Tprev:%02.1f ProcPWM:%d",tempStabSR,tempTube20Prev,ProcChimSR);
			} // @suppress("No break at end of case")
		case  MODE_POWEERREG:
			  setPower(pw);
			  break;
		default:
			break;
	}
}

void write2log(const char* s){
	cJSON *ja;
	char data[80];

	ja = cJSON_CreateObject();
	cJSON_AddItemToObject(ja, "cmd", cJSON_CreateString("logline"));
	cJSON_AddItemToObject(ja, "ch", cJSON_CreateString(""));
	cJSON_AddItemToObject(ja, "level", cJSON_CreateString(""));

	time_t CurrentTime=time(NULL);
	struct tm CurrentTm;
	localtime_r(&CurrentTime, &CurrentTm);
	snprintf(data, sizeof(data)-1, "%02d-%02d-%d %02d:%02d:%02d", CurrentTm.tm_mday,CurrentTm.tm_mon+1,CurrentTm.tm_year+1900, CurrentTm.tm_hour, CurrentTm.tm_min,CurrentTm.tm_sec);
	cJSON_AddItemToObject(ja, "date", cJSON_CreateString(data));
	cJSON_AddItemToObject(ja, "message", cJSON_CreateString(s));

 	char *r=cJSON_Print(ja);
	cgiWebsockBroadcast("/ws", r, strlen(r), WEBSOCK_FLAG_NONE);
	cJSON_Delete(ja);
	if (r) free(r);
}

void setWaitStr(const char* s){
	strcpy(wait_str,s);
}

const char *getWaitStr(void){
	return (const char*)wait_str;
}

void setWaitSensor(DsType sensor, double temperature){
	char d[WAIT_STR_LEN];
	wait_sensor = sensor;
	wait_T = temperature;
	snprintf(d, sizeof(d)-1, "%s:%3.1f", getDsTypeStr(sensor), temperature);
	setWaitStr(d);
}

void 	setWaitTime(const char* s, uint32_t time){
	char buf[WAIT_STR_LEN];
	snprintf(buf, sizeof(buf)-1, s , (time/3600), (time/60)%60, time%60);
	setWaitStr(buf);
}

inline DsType getWaitSensor(void){
	return wait_sensor;
}

inline double getWaitT(void){
	return wait_T;
}
